In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as seabornInstance

In [2]:
test1 = pd.read_csv('Data/test.txt',sep='delimiter', header = None,engine='python')

In [3]:
test1.head()

           0
0      Ahmed
1        Ali
2   Katie89K
3     @78Uio
4  Flip1992@

In [4]:
test2=test1[0].str.lower()

In [5]:
test2.head()

0        ahmed
1          ali
2     katie89k
3       @78uio
4    flip1992@
Name: 0, dtype: object

In [8]:
english_words = pd.read_csv('Data/Dictionary_Words.txt', header = None,engine='python')
places = pd.read_csv('Data/Places.txt',sep='delimiter', header = None,engine='python')
names= pd.read_csv('Data/names.txt',sep='delimiter', header = None,engine='python')
keyboard_patterns= pd.read_csv('Data/keyboard_dic.txt',sep='delimiter', header = None,engine='python')

In [11]:
english_words.describe()

               0
count      58109
unique     58108
top     chaplain
freq           2

In [10]:
english_wordsds.head()

          0
0  aardvark
1  aardwolf
2     aaron
3     aback
4    abacus

In [19]:
english_words.drop_duplicates(inplace=True)
places.drop_duplicates(inplace=True)
names.drop_duplicates(inplace=True)
keyboard_patterns.drop_duplicates(inplace=True)

In [20]:
places.describe()

                     0
count            96208
unique           96208
top     Hillcrest Park
freq                 1

In [21]:
names.describe()

             0
count   225706
unique  225706
top     dehlia
freq         1

In [22]:
keyboard_patterns.describe()

           0
count    647
unique   647
top     8ik,
freq       1

In [23]:
english_words.describe()

            0
count   58108
unique  58108
top       due
freq        1

In [24]:
keyboard_patterns.head()

      0
0  1qaz
1  2wsx
2  3edc
3  4rfv
4  5tgb

In [25]:
pass_list1 = pd.read_csv('Data/yahoo.txt',sep='delimiter', header = None,engine='python')

In [26]:
pass_list1.head()

            0
0  @fl!pm0de@
1        pass
2     steveol
3      chotzi
4      lb2512